<template>
    <my-page title="帮助" backable>
        <ui-article>
            <h2>说明</h2>
            <p>这是一个在线的 epub 格式电子书阅读器，无需登录即可使用。</p>

            <h2>使用</h2>
            <p>略。</p>
            <h2>快捷键</h2>
            <ul>
                <li>左方向键/上方向键：上一页</li>
                <li>右方向键/下方向键：下一页</li>
                <li>Esc 键：回到首页</li>
            </ul>

            <h2>浏览器要求</h2>
            <p>请使用最新的谷歌浏览器访问本站。</p>
            <p>暂不支持谷歌浏览器 v63.0.3239.84 及更旧的版本，v65.0.3325.181 可正常使用，其他版本未测试。</p>
        </ui-article>
    </my-page>
</template>
