<template>
    <my-page title="帮助" backable>
        <ui-article>
            <h2>说明</h2>
            <p>这是一个在线的 epub3.0 格式电子书阅读器，无需登录即可使用。</p>
            <p>只支持 epub3.0 格式的电子书，暂不支持其他格式或其他旧版本的电子书。</p>

            <h2>快捷键</h2>
            <ul>
                <li>左方向键/上方向键：上一页</li>
                <li>右方向键/下方向键：下一页</li>
                <li>Esc 键：回到首页</li>
            </ul>

            <h2>浏览器要求</h2>
            <p>请使用最新的谷歌浏览器访问本站。</p>
            <p>不支持谷歌浏览器 v63.0.3239.84 及更旧的版本，v65.0.3325.181 可正常使用，其他版本未测试。</p>

            <h2>常见问题</h2>
            
            <p><strong>上传的书籍是永久保存的吗？</strong></p>
            <p>不是的，本地上传的所有图书，以缓存数据的形式保存在浏览器中，由于浏览器会根据系统储存空间的大小，
                “自动、不定时”清理缓存数据，因此不建议您保存过多数据在 Web 端应用中。
            </p>

            <p><strong>如何使用云端书籍？</strong></p>
            <p>如果你有自己的服务器，你可以把电子书上传到你的服务器，并且设置<strong>允许跨域</strong>。
                然后在首页点击【添加云端书籍】图标，输入网址，就可以在任意设备上查看书籍。</p>

            <p><strong>添加图书失败</strong></p>
            <p>如果添加失败，可能有如下几个原因：</p>
            <p>1.书本被加密，只能使用特定的软件打开，比如你只能用掌阅APP打开掌阅的电子书。这是出于对电子版权的保护，我们无法解决。</p>
            <p>2.书本制作水平较差，不够规范。 有些图书在制作时却不遵守官方规范，导致解析失败。这种情况下，有些阅读器还是可以打开的，但是有些阅读器无法打开。你可以使用Calibre软件进行一次“ePub to ePub”的格式转换，一般转换后的电子书就可以正常解析了。</p>
            <p>3.文件本身被破坏，或不是有效的ePub文件。这种情况所有的阅读器都是无法打开的。</p>

            <!-- <p><strong>添加的图书没有封面</strong></p>
            <p>我们会按照ePub文件的标准规范提取图书的封面，如果您添加的ePub文件没有按照规范设置封面图片的话，我们是无法提取到的。</p> -->
        </ui-article>
    </my-page>
</template>
